import numpy as np
# 数组的广播就是为了让不同维度的数组进行相加
arr1 = np.arange(4).reshape(2,2)
print(arr1)
arr2 = np.array([1,2])
print(arr2)
print(arr1+arr2)
'''
[[0,1]
[2,3]]----(2,2)
[1,2]-----(2,)
列扩充
'''

#
arr3 = np.array([1,2])
arr4 = np.array([[1,2],[1,2],[1,2]])
print(arr3+arr4)
'''
[[1,2]
[1,2]
[1,2]]---(3,2)
[1,2]----(1,2)
这个之所以可以相加，是因为首先除了要补全的形状以外，其他的可以相同，这样凑成了广播机制
'''
# 问题  数组1 shape =（2,3,4,5,6,7,8）
# 数组2 shape = （1,7,8）  数组1和数组2 可以算术计算

# 数组3  shape=(7,8,9,4,2)
# 数组4 shape = (7,2,1,4,2) 数组3 和数组4不能进行算术计算